<!DOCTYPE HTML PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xml:lang="pt" xmlns="http://www.w3.org/1999/xhtml" lang="pt"><head profile="http://gmpg.org/xfn/11">


<meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><title>Marcos Torres : Curr&iacute;culo</title>
<link rel="stylesheet" href="resume_default.css" type="text/css">
<!-- hResume is composed thusly:

The hResume schema consists of the following:
	* hResume
		o summary. optional. text.
		o contact info. required. <address> + hCard.
        o experience. optional. One or more hcalendar events with the class
          name 'experience', with an embedded hCard indicating the job title,
          name of company, address of company etc.
        o education. optional One or more hcalendar events with the class name
          'education', with an embedded hCard indicating the name of school,
          address of school etc.
		o skills. optional. phrases or keywords using the rel-tag microformat with the class name 'skill'.
		o affiliations. optional. the class name affiliation along with an hcard of the organization
		o publications. optional. One or more citations. Use cite tag. 
-->

</head><body class="hresume">
<!-- Personal Contact Information in hCard markup -->

<div class="vcard">
  <div class="lang"><a href="curriculum.en.html">[EN]</a></li></div>
  <h1 class="fn n" id="name"><a class="url" href="https://tilde.pt/~marado" rel="me"><span class="given-name">Marcos</span> <span class="family-name">Torres</span></a></h1>
  <address class="adr">
<span class="locality">Lamego</span>, <abbr class="country" title="Portugal">PT</abbr>
  </address>
  <div class="tel"><abbr class="type" title="cell">Mobile phone:</abbr> <abbr class="value" title="+351931013548">+351 96 532 1998</abbr></div>
  <div class="email"><abbr class="type" title="email">Email:</abbr> <a href="mailto:mindboosternoori@gmail.com" class="value">mindboosternoori@gmail.com</a></div>
</div>

<!-- End Personal Contact Information -->

<h2>Perfil</h2>

<!-- hResume summary section. Defined with a class 'summary' -->

<p class="summary">
Marcos Marado Torres tem uma larga experiência no desenho de Sistemas, nos últimos anos mais focada no desenvolvimento de Sistemas Operativos e Hardware, com particular foco em dispositivos Android.
Foi durante vários anos Presidente da ANSOL - Associação Nacional para o Software Livre, e possui um enorme interesse e gosto por &aacute;reas de Inform&aacute;tica Social, como o Software Livre, Seguran&ccedil;a, Anonimato e Direitos Digitais. 
<br/>Domina as L&iacute;nguas Portuguesa e Inglesa.
</p>

<!-- end summary section -->

<!-- Beginning of experience. This is a vcalendar broken up into different experience events. -->

<h2>Experi&ecirc;ncia Profissional</h2>
<ul class="vcalendar">

<li class="experience vevent vcard">
    <h3><span class="org">
    <a rel="contractor" href="https://bymason.com/">Mason</a>
    </span></h3>
	<div class="location">Remoto, PT</div>
    <div class="period"><abbr class="dtstart" title="2018">2018</abbr> - <abbr class="dtend" title="2025">2025</abbr></div>
    <h4 class="summary"><span class="title">Engenheiro de Dispositivos</span></h4>
    <p class="description">
    Lidera a equipa de dispositivos da Mason.
    </p>
	<ul class="achievements">
		<li>Coordena a equipa de dispositivos, a sua relação com a equipa de Engenharia nos EUA, e a equipa de hardware na Ásia.</li>
		<li>Responsável pela integração do Sistema Operativo, Mason OS, em toda a gama de produtos de hardware da Mason.</li>
		<li>Acompanha todo o ciclo de vida de desenvolvimento de um novo produto de hardware, desde a fábrica até ao cliente final.</li>
	</ul>
</li>

<li class="experience vevent vcard">
    <h3><span class="org">
    <a rel="employer" href="http://BSP.ninja/">Convergent Evolution</a>
    </span></h3>
	<div class="location">Lisboa, PT</div>
    <div class="period"><abbr class="dtstart" title="2016">2016</abbr> - <abbr class="dtend" title="2018">2018</abbr></div>	
    <h4 class="summary"><span class="title">Engenheiro de Android e Infraestrutura</span></h4>
    <p class="description">
    Foi Engenheiro de Android e Infraestrutura na Convergent Evolution, estando envolvido em diversos projectos para diferentes clientes.
    </p>
	<ul class="achievements">
	  <li>Apoia e faz consultadoria &agrave; equipa de engenharia da Mason, no desenvolvimento da vers&atilde;o de Android espec&iacute;fica &agrave; sua gama de dispositivos.</li>
	  <li>Foi o Engenheiro respons&aacute;vel pela manuten&ccedil;&atilde;o da primeira gera&ccedil;&atilde;o de telem&oacute;veis da WileyFox (WileyFox Swift e WileyFox Storm), estando envolvido no desenho da vers&atilde;o de Android comum a todos os dispositivos da marca.</li>
	  <li>Esteve envolvido no desenho e cria&ccedil;&atilde;o da infraestrutura necess&aacute;ria para a implanta&ccedil;&atilde;o de uma nova OEM.</li>
	  <li>Preparou, para a Cyanogen, um update ao S.O. para o BQ Aquaris X5.</li>
	</ul>
</li>

<li class="experience vevent vcard">
    <h3><span class="org">
    <a rel="employer" href="http://www.cyngn.com/">Cyanogen</a>
    </span></h3>
	<div class="location">Lisboa, PT</div>
    <div class="period"><abbr class="dtstart" title="2014">2014</abbr> - <abbr class="dtend" title="2016">2016</abbr></div>	
    <h4 class="summary"><span class="title">Engenheiro de Sistemas</span></h4>
    <p class="description">
    Foi Engenheiro de Sistemas na Cyanogen, sendo respons&aacute;vel pela integra&ccedil;&atilde;o e suporte do Cyanogen OS em determinadas plataformas e dispositivos.
    </p>
	<ul class="achievements">
	<li>Implementou o suporte das arquitecturas msm8909 e msm8937 no Cyanogen OS.</li>
	<li>Foi o Engenheiro respons&aacute;vel pela integra&ccedil;&atilde;o do Sistema Operativo Cyanogen OS no telem&oacute;veis das arquitecturas msm8909, msm8916 e msm8939, em particular os dispositivos BQ Aquaris X5, Wileyfox Swift, Wileyfox Storm e Alcatel Pop Mirage.</li>
	<li>Trabalhou na migra&ccedil;&atilde;o do suporte de v&aacute;rios dispositivos para novas vers&otilde;es do Cyanogen OS.</li>
	</ul>
</li>

<li class="experience vevent vcard">
    <h3><span class="org">
    <a rel="employer" href="http://www.nos.pt/">NOS</a>
    </span></h3>
	<div class="location">Lisboa, PT</div>
    <div class="period"><abbr class="dtstart" title="2005">2005</abbr> - <abbr class="dtend" title="2014">2014</abbr></div>	
    <h4 class="summary"><span class="title">Arquitecto de Servi&ccedil;os</span></h4>
    <p class="description">
    Desde Fevereiro de 2007 passou a desempenhar o cargo de Arquitecto de Servi&ccedil;os na direc&ccedil;&atilde;o de IT/IS da Optimus, agora NOS, 
	tendo a seu cargo a gest&atilde;o destes servi&ccedil;os e sistemas desde a fase de concep&ccedil;&atilde;o e itera&ccedil;&atilde;o evolutiva at&eacute; &agrave; infra-estrura de servidores e redes que os suportam.
	O seu trabalho centra-se principalmente no desenho e coordena&ccedil;&atilde;o da implementa&ccedil;&atilde;o da arquitectura de solu&ccedil;&otilde;es para diversos sistemas e servi&ccedil;os, 
	sendo esperado da sua fun&ccedil;&atilde;o elevada autonomia, capacidade de lideran&ccedil;a e coordena&ccedil;&atilde;o de equipas e de tomada de decis&otilde;es.
    </p>
	<ul class="achievements">
	<li>Teve sobre a sua al&ccedil;ada muitos dos servi&ccedil;os de ISP Core da companhia, como os servi&ccedil;os de cloud, AAA, DNS, et cetera.</li>
	<li>Teve sob sua responsabilidade todo o servi&ccedil;o de e-mail a clientes, sejam eles residenciais (ex: Clix, Mail.PT, Kanguru) ou empresariais.</li>
	<li>Foi o respons&aacute;vel IT pelo servi&ccedil;o de televis&atilde;o da Optimus, at&eacute; ao seu t&eacute;rmino.</li>
	</ul>
	<h4 class="summary"><span class="title">Analista de Inform&aacute;tica - Programador</span></h4>
	<p class="description">Foi Analista de Inform&aacute;tica desempenhando a fun&ccedil;&atilde;o de Programador na equipa de Project
	Development da SonaeCom ISP, pertencente &agrave; divis&atilde;o de Sistemas de Informa&ccedil;&atilde;o da
	SonaeCom. Esteve envolvido em projectos 
	para v&aacute;rias unidades de neg&oacute;cio da SonaeCom: Novis,
	Clix e Optimus. Lida principalmente com a linguagem de programa&ccedil;&atilde;o Perl (Mason,
	Template Toolkit, SOAP::Lite), bases de dados Oracle e MySQL e servidores web
	Apache httpd. O seu trabalho centra-se principalmente no desenvolvimento de
	Sistemas de Informa&ccedil;&atilde;o, desde o seu n&uacute;cleo at&eacute; &agrave; camada de apresenta&ccedil;&atilde;o, e no
	desenvolvimento de servi&ccedil;os que usufruam dos recursos desses Sistemas.</p>
	<ul class="achievements">
	<li>Desenvolveu novas ofertas de servi&ccedil;o de Internet e Telefone para o <a href="http://www.clix.pt/">Clix</a>.</li>
	<li>Desenvolveu o produto de cloud storage da <a href="http://www.novis.pt/">Novis</a>.</li>
	<li>Desenhou e desenvolveu o sistema de comunica&ccedil;&atilde;o entre o principal
	Sistema de Informa&ccedil;&atilde;o do ISP e outros sistemas que com ele queiram
	dialogar.</li>
	</ul>
</li>

<li class="experience vevent vcard">                                                                             
		<h3><span class="org">
		<a rel="employer" href="http://www.magicbrain.biz/">MagicBrain - Internet Services Provider</a>
		</span></h3>
		<div class="location">Coimbra, PT</div>
    	<div class="period">
    	<abbr class="dtend" title="2005">2005</abbr>
    	</div>
		<h4 class="summary"><span class="title">Analista Inform&aacute;tico de Sistemas</span></h4>
<p class="description">Trabalhou na empresa MagicBrain - Internet Services Provider como
    Analista Inform&aacute;tico de Sistemas, acumulando as fun&ccedil;&otilde;es de Gestor de
        Projecto, Admistrador de Sistemas, Administrador de Redes,
            Administrador de Bases de Dados e Programador (de sofware stand-alone
                e web-based). Como programador lidou principalmente com PHP, MySQL e
                    Apache. Como administrador de sistemas, lidou principalmente com
                        sistemas GNU/Linux, maioritariamente Debian, Mandrake e Fedora. Tendo
                            elaborado o est&aacute;gio para o t&eacute;rmino da Licenciatura nesta empresa,
                                discorreu sobre os v&aacute;rios paradigmas de Engenharia de Software, em
                                    que casos se aplicam, falando de UML, RUP, Redes PERT/CPM, Mapas de
                                        Gantt, CMM, SPICE, e dando uma especial &ecirc;nfase ao "Agile Software
                                            Development".
</p>
<ul class="achievements"><li>Desenvolveu o Sistema de Informa&ccedil;&atilde;o da empresa <a href="http://www.stricker.pt/">Paul &amp; Stricker, Lda.</a>.</li>
<li>Participou no desenvolvimento do Aardvark: uma framework de AJAX em PHP.</li>
<li>Participou no desenvolvimento do Help Center Live: um sistema web-based de atendimento a clientes.</li></ul>
</li>

<li class="experience vevent vcard">                                                                             
    <h3 class="org">UniOne</h3>
	<div class="location">Coimbra, PT</div>
    <div class="period"><abbr class="dtstart" title="2003">2003</abbr> - <abbr class="dtend" title="2004">2004</abbr></div>
		<h4 class="summary">Analista Inform&aacute;tico de Sistemas</h4>
<p class="description">Trabalhou na empresa UniOne como Analista Inform&aacute;tico de Sistemas,
    acumulando as fun&ccedil;&otilde;es de Gestor Inform&aacute;tico, Gestor de Equipa, Gestor
        de Projecto, Administrador de Sistemas, Administrador de Rede,
            Administrador de Bases de Dados, Programador entre outros. Como
                programador lidou principalmente com PHP, MySQL e Apache. Como
                    adminstrador lidou com sistemas GNU/Linux (Mandrake) e Microsoft
                        Windows.
</p>
<ul class="achievements">
<li>Geriu a equipa inform&aacute;tica da empresa.</li>
<li>Desenhou toda a arquitectura Inform&aacute;tica a usar pelo grupo de empresas sediadas nas instala&ccedil;&otilde;es da UniOne.</li>
<li>Desenhou o Sistema de Informa&ccedil;&atilde;o da UniOne.</li>
</ul>
</li>
<!-- End of experience section. -->

<!-- Academic curriculum section.  -->
<h2>Habilita&ccedil;&otilde;es Acad&eacute;micas</h2>
<ul>

<!-- maybe add here copyrightx-certificate.pdf -->
<li class="education vevent vcard">                                                                             
    <h3>Licenciatura em Engenharia Inform&aacute;tica</h3>
	<div>Departamento de Engenharia Inform&aacute;tica da Universidade de Coimbra, PT</div>
    <div class="period"><abbr class="dtstart" title="1999">1999</abbr> - <abbr class="dtend" title="2005">2005</abbr></div>
<p>
</p><p class="description">
Concluiu a Licenciatura de cinco anos em Engenharia Informática da <a href="https://www.uc.pt/fctuc/dei/">Universidade de Coimbra</a>.
</p></li></ul>
<!-- End of academic section -->
<hr>
<p class="misc">Refer&ecirc;ncias e mais informa&ccedil;&atilde;o dispon&iacute;vel a pedido.</p>
<div align="right"><p class="misc">Lamego, Portugal, 23 de Março de 2025</p>

</div></ul></body></html>
